# текти для сторінки граматики 
page1 = {
    "section": "Іменники та означені артиклі (Der, Die, Das)",
    "intro": [
        "У німецькій мові всі іменники пишуться з великої літери, а все інше - з маленької.Ми змінюємо безпосередньо іменник, коли відмінюємо іменники в українській мові.Наприклад, мама, мамі, маму, мамою і т.д.",
        "А в німецькій мові іменник майже завжди залишається незмінним. Наприклад, слово «мама» у всіх відмінках буде однаковим - «Mutter». Німці придумали артиклі, щоб показати, який саме це відмінок. Це такі маленькі слова, які стоять перед іменниками і показують якого він роду, у якому відмінку та числі."
    ],
    "articles": [
        {
            "article": "DER",
            "description": "артикль чоловічого роду.",
            "examples": [
                "Особи чоловічої статі, професії, тварини (der Vater – тато, der Lehrer – вчитель).",
                "Дні тижня, місяці, пори року (der Dienstag - вівторок, der April - квітень, der Winter - зима).",
                "Сторони світу (der Norden - північ).",
                "Іменники для позначення осіб чоловічої статі з суфіксами -ant, -ent, -ist, -loge, -eur, -är (наголошені), -or (ненаголошені) (der Ingenieur - інженер)."
            ]
        },
        {
            "article": "DIE",
            "description": "артикль жіночого роду.",
            "examples": [
                "Особи жіночої статі (die Mutter - мама, die Oma - бабуся).",
                "Професії та особи жіночої статі, які закінчуються на - in (die Lehrerin - вчителька).",
                "Іменники, які закінчуються на -е та не позначають осіб чоловічої статі (die Woche - тиждень).",
                "Іменники з суфіксами -falt, -heit, -keit, -schaft, -ung (Fruendschaft, Zeitung)."
            ]
        },
        {
            "article": "DAS",
            "description": "артикль середнього роду.",
            "examples": [
                "Слова іноземного походження (das Hotel - готель).",
                "Іменники зі зменшувальними суфіксами -chen, -lein (das Mädchen - дівчинка).",
                "Субстантивовані (ті, які стали іменниками) інфінітиви (das Essen - їжа)."
            ]
        }
    ],
    "gender_mismatch": {
        "title": "Проблема може виникнути тоді, коли рід у німецькій та українській мовах не збігається.",
        "example":[
            'Наприклад',
            'дитина: українською - дитина (жіночий рід), німецькою - das Kind (середній рід).',
            'або',
            'українською - яблуко (середній рід), німецькою - der Apfel (чоловічий рід).',
        ]
    },   
    "plural": {
        'title':'Множина',
        'example':["Якого б роду не був іменник, у множині його артикль перетворюється на «die».",
        "Наприклад, дитина - das Kind, а діти - die Kinder.",
        "Бачимо, що ми не тільки змінюємо артикль, а й додаємо закінчення.",
        "Вони можуть бути різними: -n, -en, -e, -r, -er, -s. Є випадки, коли нічого не потрібно додавати.",
        "Наприклад, der Lehrer (вчитель) - die Lehrer (вчителі).",
        "Також може з’явитись тільки Ü.",
        "Наприклад, die Mutter (мама) - die Mütter (мами).",
    ]},
    "compound_words": [
        "Мабуть, всі бачили дуже довгі німецькі слова, які лякають початківці у вивченні мови.",
        "Насправді, вони не є такими страшними, оскільки просто зліплені з декількох слів.",
        "Нам потрібно їх розділити на частини і перекласти кожне слово окремо.",
        "Запам’ятайте, головне слово - це останнє.",
        "Наприклад: der Kindergarten = die Kinder + der Garten.",
        "Це слово складається з двох іменників (діти + сад). Головним є слово «Сад», тому фінальне складне слово чоловічого роду (дитячий садок)."
    ]
}


page2 = {
  "title": "Множина іменників",
  "description": "Іменники множини в німецькій мові можуть мати закінчення -n, -en, -e, -r, -er, -s, але іноді взагалі не мають закінчень. Наступні правила допоможуть вам вгадати правильну форму в більшості випадків:",
  "blocks": [
    {
      "title": "Іменники в множині з -n або -en",
      "items": [
        "Іменники чоловічого роду, що закінчуються на ‑e, ‑ent, ‑and, ‑ant, ‑ist, ‑or:\nder Artist - die Artisten",
        "Іменники жіночого роду, що закінчуються на  ‑e, ‑ion, ‑heit, ‑keit, ‑schaft, ‑tät, ‑ung:\ndie Mannschaft - die Mannschaften, die Krankheit - die Krankheiten",
        "Іменники, що закінчуються на ‑ma, ‑um,‑us:\ndas Thema - die Themen"
      ]
    },
    {
      "title": "Іменники в множині з -e",
      "items": [
        "Іменники чоловічого роду, що закінчуються на ‑ig, ‑ör, ‑ich, ‑eur, ‑ling, ‑ier:\nder Friseur - die Friseure",
        "Односкладові іменники жіночого роду:\ndie Hand - die Hände, die Maus - die Mäuse (тут з’являється ще й Ü)"
      ]
    },
    {
      "title": "Іменники в множині з -s",
      "items": [
        "Іменники, що закінчуються на ‑a, ‑i, ‑o, ‑u, ‑y:\ndas Auto - die Autos, der Bikini - die Bikinis",
        "Прізвища: die Zimmermanns"
      ]
    },
    {
      "title": "Множина іменників без змін",
      "items": [
        "Іменники чоловічого роду, що закінчуються на ‑el, ‑en, ‑er:\nder Löffel - die Löffel, der Wagen - die Wagen",
        "Іменники середнього роду, що закінчуються на ‑lein, ‑chen:\nDas Mädchen - Die Mädchen"
      ]
    }
  ]
}


page3 = {
  "title": "Неозначений артикль: ein / eine",
  "description": [
    "У німецькій мові іменники поділяються за родами: вони можуть бути чоловічого (der), жіночого (die) або середнього (das) роду.",
    "До іменників вживаються артиклі, які бувають двох типів: означені (der, die, das) та неозначені (ein, eine)."
  ],
  "table": {
    "headers": ["Рід", "Означений артикль", "Неозначений артикль"],
    "rows": [
      ["der (чоловічий)", "der", "ein"],
      ["die (жіночий)", "die", "eine"],
      ["das (середній)", "das", "ein"],
      ["(множина)", "die", "—"]
    ]
  },
  "blocks": [
      {
          "list":['🔸 Якщо предмет згадується вперше, вживається неозначений артикль: Das ist ein Auto. – Це (якась) машина.', 
                  '🔸 Якщо предмет вже знайомий – означений артикль: Das Auto ist rot. – Ця машина червона.'],
          "example":'Приклад: Hier ist ein Tisch. Der Tisch ist neu. (Ось стіл. Він новий.)'
      },
      {
          "list":['🔸Неозначений артикль зазвичай не перекладається, але іноді його можна передати як «один/одна», щоб підкреслити кількість', ],
          "example":'Приклад: Ein Apfel liegt auf dem Tisch. – На столі лежить одне яблуко'
      }
  ]
}


page4 = {
    "title": "Особові займенники er / sie / es",
    "description": "Особові займенники er, sie або es добираються залежно від граматичного роду іменника, який замінюється. Особові займенники er, sie або es стосуються як живих істот, так і предметів.",
    "lists":[
        {
            'title':'',
            'items':[
                "Іменники чоловічого роду «der» замінюються займенником er.",
                "Іменники жіночого роду «die» замінюються займенником sie.",
                "Іменники середнього роду «das» замінюються займенником es."
            ]
        },
        {
            'title':'Приклад',
            'items':[
                "Hier ist ein Stuhl. Er ist bequem. – Ось стілець. Він зручний.",
                "Hier ist ein Fenster. Es ist offen. – Ось вікно. Воно відчинене.",
                "Das ist eine Lampe. Sie ist hell. – Це лампа. Вона яскрава."
            ]
        },
    ]
}

page5 = {
  "title": "Відмінювання дієслів",
  "description": "У цьому розділі ви навчитесь відмінювати німецькі дієслова за особами та утворювати прості речення німецькою мовою.\nДієслова у початковій формі мають закінчення -en: singen, tanzen, spielen. Коли дієслово змінюється за особами, воно має різні закінчення.\nУважно ознайомтеся з таблицею та вивчіть зміну закінчень при відмінюванні.\nПочаткова форма дієслова – spielen (грати).",
  "table": {
    "headers": ["Особа", "Закінчення", "Приклад"],
    "rows": [
      ["ich (я)", "-e", "spiele (граю)"],
      ["du (ти)", "-st", "spielst (граєш)"],
      ["er (він)", "-t", "spielt (грає)"],
      ["sie (вона)", "-t", "spielt (грає)"],
      ["es (воно)", "-t", "spielt (грає)"],
      ["wir (ми)", "-en", "spielen (граємо)"],
      ["ihr (ви – множина)", "-t", "spielt (граєте)"],
      ["sie (вони)", "-en", "spielen (грають)"],
      ["Sie (Ви – ввічливо)", "-en", "spielen (Ви граєте)"]
    ]
  },
  "list": {
      "title": "Наприклад:",
      "items": [
        "Sie singt das Lied. – Вона співає пісню.",
        "Ich tanze gern. – Я танцюю охоче."
      ]
    }
  
}


