# тексти для сторінки фонетики
info_text = (
            "Німецький алфавіт базується на латинській графічній системі та складається з 26 основних літер, "
            "а також додаткових символів – умляутів (ä, ö, ü) і лігатури ß (Eszett або scharfes S). "
            "Він є основою для німецької мови, яка має чіткі фонетичні правила, де більшість літер вимовляються стабільно, "
            "хоча деякі можуть змінювати звучання залежно від контексту. Завдяки цій структурованості, "
            "німецька мова зручна для читання й письма, хоча її вимова та правопис мають свої особливості, які варто вивчити детальніше."
        )

readRules = {
  "title": "Правила читання",
  "description" : "У німецькій мові наголос (Betonung) зазвичай падає на перший склад слова, але є винятки, які залежать від походження слова, префіксів та суфіксів.",
  "blocks": [
    {
      "subtitle": "1. Основне правило",
      "content": "Наголос на першому складі у споконвічних німецьких словах:\n● Vater ['fa:tɐ] - батько\n● Mutter ['mʋtɐ] - мати"
    },
    {
      "subtitle": "2. Слова з префіксами",
      "content": "Наголос зберігається на корені, якщо префікс невідокремлюваний:\n● verstehen [fεɐ'ʃte:ən] - розуміти\n● bekommen [bə'kɔmən] - отримувати\nНевідокремлювані префікси: be-, ge-, er-, ver-, zer-, ent-, emp-, miss-.\n\nНаголос падає на префікс, якщо він відокремлюваний:\n● anrufen → ÁN-ru-fen\n● mitkommen → MÍT-kom-men\nВідокремлювані префікси: ein-, auf-, vor-, weg-, unt-."
    },
    {
      "subtitle": "3. Запозичені слова",
      "content": "Слова, запозичені з французької, латини або грецької, часто мають наголос на останньому або передостанньому складі:\n● Familie → fa-MÍ-lie\n● Hotel → ho-TÉL"
    },
    {
      "subtitle": "4. Наголос у складних словах (Komposita)",
      "content": "Нові слова творяться складанням двох або більше основ. Наприклад:\ndie Speise + die Karte = die Speisekarte (меню)\n\nУ складних словах:\n● Головний наголос (') – на перший корінь\n● Другорядний (`) – на другий корінь\nНаприклад: Familienname ['familiən`na:mə] - прізвище"
    },
    {
      "subtitle": "Інтонація",
      "content": "Інтонація — важливий компонент усного мовлення. Вона впливає на зміст, емоційність і логіку речення.\n\nТипи інтонації в німецькій мові:\n- падаюча (Fallen)\n- зростаюча (Steigen)\n- комбінована (Steigen-Fallen)"
    }
  ]
}

reedRules2 = {
  "title": "Правила читання",
  "sections": [
    {
      "title": "Загальні правила наголосу",
      "description": "У німецькій мові наголос (Betonung) зазвичай падає на перший склад слова, але є винятки, які залежать від походження слова, префіксів та суфіксів.",
      "blocks": [
        {
          "subtitle": "1. Основне правило - наголос на першому складі у споконвічних німецьких словах.",
          "content": [
            "Vater [фа́та] - батько",
            "Mutter [му́та] - мати"
          ]
        },
        {
          "subtitle": "2. Слова з префіксами (залежить від типу префікса)",
          "content": [
            "Наголос зберігається на корені, якщо префікс невідокремлюваний.",
            "verstehen [феште́:н] - розуміти",
            "bekommen [беко́мен] - отримувати",
            "Невідокремлювані префікси: be-, ge-, er-, ver-, zer-, ent-, emp-, miss-.",
            "Наголос падає на префікс, якщо він відокремлюваний. У таких випадках наголос стоїть на префіксі, бо він є основною частиною слова.",
            "anrufen [а́нруфен] - дзвонити",
            "mitkommen [м'íткомен] - йти разом",
            "Відокремлювані префікси: ein-, auf-, vor-, weg-, unt-."
          ]
        },
        {
          "subtitle": "3. Запозичені слова – наголос НЕ на першому складі.",
          "content": [
            "Слова, запозичені з французької, латини або грецької, часто мають наголос на останньому або передостанньому складі.",
            "Hotel [хоте́л´] - готель"
          ]
        },
        {
          "subtitle": "4. Наголос у складних словах (Komposita)",
          "content": [
            "У німецькій мові нові слова творяться складанням двох або більше основ. Наприклад: die Speise (їжа) + die Karte (карта) = die Speisekarte (меню)",
            "У складних словах в німецькій мові є головний наголос (Hauptbetonung) та другорядний наголос (Nebenbetonung).",
            "Головний наголос (') – падає на перший корінь (основу слова).",
            "Другорядний наголос () – падає на другий корінь.",
            "Наприклад, Familienname ['фам'іл'іеннаме] - прізвище"
          ]
        }
      ]
    },
    {
      "title": "Інтонація",
      "description": "Інтонація є важливим компонентом усного мовлення, оскільки вона впливає на розуміння змісту висловлювання, його емоційне забарвлення та логічну структуру. У німецькій мові інтонація визначається зміною висоти голосу в межах речення і має свої особливості залежно від його типу.",
      "blocks": [
        {
          "subtitle": "Підвищення тону в кінці речення",
          "content": [
            "Зазвичай несе інформацію про незавершеність думки або про питання.",
            "Наприклад: Hast du Zeit?⬈ - У тебе є час?"
          ],
          "image": "pc1.png"  
        },
        {
          "subtitle": "Розповідні речення",
          "content": [
            "Зазвичай мають падаючу інтонацію в кінці речення.",
            "Наприклад: Ich gehe ins Kino.⬊ - Я йду в кіно."
          ],
          "image": "pc2.png"  
        },
        {
          "subtitle": "Заперечні речення",
          "content": [
            "Можуть мати підйом інтонації в кінці речення, щоб показати сумнів або подив.",
            "Наприклад: 😲 Das ist nicht wahr?⬈ - Це неправда?"
          ],
          "image": "pc3.png"  
        },
        {
          "subtitle": "Діалог для закріплення інтонації",
          "content": [
            "- Ich heiße Roma.⬊",
            "- Und du? ⬈ Wie heißt du? ⬈",
            "- Mein Name ist Polina. ⬊",
            "- Wo wohnst du? ⬈",
            "- Ich wohne in der Ukraine. ⬊"
          ]
        }
      ]
    }
  ]
}

alphabet_blocks = [
  {
    "title": "Буква С",
    "description": "Звучить вона як українська [к]. Найчастіше ми будемо її зустрічати у запозичених словах (Computer, Cola). У німецьких словах використовується всередині слова і разом з буквою k: -ck [к] (wecken, Decke)."
  },
  {
    "title": "Буква S",
    "description": "Перед голосними вона буде дзвінкою - [з] (singen, Rose). В інших випадках - звук [c] (ist, das, Minus). Якщо зустрічається подвійна ss, то також звучить як [c] (Messe, wissen)."
  },
  {
    "title": "Буква V",
    "description": "В словах іноземного походження - [в]: Villa, Vase, Vulkan. В німецьких словах - [ф]: Volkswagen, Vogel."
  },
  {
    "title": "Буква J",
    "description": "Зазвичай звук [й]: ja, Jugend, Jacke. Іноді запозичені з англійської мови слова будуть мати звук [дж]: Job, Jeans."
  },
  {
    "title": "Буква Ä",
    "description": "Дає звук [е]: Äpfel, Mädchen."
  },
  {
    "title": "Буква Ö",
    "description": "Це м’яка буква О. Уявіть, ніби ми поставили перед нею м’який знак ь - [ьо]: Löwe, Kröte."
  },
  {
    "title": "Буква Ü",
    "description": "Аналогічно уявляємо перед нею м’який знак ь - [ьу]: Tür, fünf."
  },
  {
    "title": "Буква L",
    "description": "Ця буква є м’якою: Blume, Lunge."
  },
  {
    "title": "Буква H",
    "description": "Після голосних («ah», «eh», «ih», «oh», «uh»…) не читається: Ahn, Uhr, wohnen. В інших випадках - звук [х]: Hallo, Hund."
  },
  {
    "title": "Буква Z",
    "description": "Тут лише один варіант - звук [ц]: Zebra, Zoo, zwölf, Zivilisation. Тут варто зазначити, що суфікс «-tion» читається як [ц´он]."
  },
  {
    "title": "Буква ß",
    "description": "Ще одна суто німецька буква. Фактично, це подвійна ss. Наприклад, Fluß = Fluss, Fußball = Fussball."
  },
  {
    "title": "Буква Q",
    "description": "Вживається із буквою U. Разом вони дають звук [кв]. «qu» = «кв». Наприклад, Quadrat, Aquarium, Aquapark."
  },
  {
    "title": "Буква R",
    "description": "Звук утворюється у задній частині гортані і звучить як гаркавий. Це найбільш типова вимова у сучасній стандартній німецькій мові. Вимовляється дещо специфічно, для цього потрібно практикуватися та слухати вимову німецьких слів. Головне запам’ятати, що в кінці звук [р] зникає і з’являється майже звук [а]. Наприклад, Zimmer, Ritter."
  },
  {
    "title": "Поєднання літер і вимова",
    "description": (
        "Поєднання деяких літер у німецькій мові дає один певний звук. "
        "Це також є важливим аспектом, який потрібно запам’ятати."
    ),
   "examples": [
          {"type": "text", "content": "«ch» = [х]: ich, Kuchen, Milch."},
          {"type": "text", "content": "«sch» = [ш]: schwarz, Schwester."},
          {"type": "text", "content": "«tsch» = [ч]: Tschüß, Quatsch."},
          {"type": "spacer"},
          {"type": "subtitle", "content": "На початку кореню:"},
          {"type": "text", "content": "«st» = [шт]: stoppen, stehen."},
          {"type": "text", "content": "«sp» = [шп]: spielen, Spiegel."},
          {"type": "spacer"},
          {"type": "subtitle", "content": "Голосні:"},
          {"type": "text", "content": "«eu» = [ой]"},
          {"type": "text", "content": "«äu» = «eu» = [ой]: Deutsch, Euro, Bäumer."},
          {"type": "text", "content": "«ei» = [ай]: drei, Reis, Eis."},
          {"type": "text", "content": "«ie» вимовляється як довга [і] = [і:]: Tier, viel."}
      ]
  }

]
